      * **++ Area output per inblock TLV
       01 TLV-:X:-OUT.
         03 TLV-:X:-TEXT.
           05 TLV-:X:-TEXT-LEN               PIC 9(9) COMP.
           05 TLV-:X:-TEXT-DATA              PIC X(999).
