      * **++ XDBLKCR  LINKAGE RESULT COPYBOOK
      *
       01 MR.
         03 MR-RESULT                  PIC 9(9) COMP.
         03 MR-DESCRIPTION             PIC X(300).
         03 MR-POSITION                PIC X(050).
